# Data Science Packages - Pandas
In this notebook, we will illustrate the core functionality of the Pandas package in Python.

In [1]:
import pandas as pd

The data that will be used is a cleaned version of the *movies* dataset that is publicly available on Kaggle. The cleaned version has been made available on the course's AWS S3 bucket:

In [2]:
movies = pd.read_parquet('https://kuleuven-mda.s3.eu-central-1.amazonaws.com/movies.parquet.gzip')
movies

,id,original_title,release_date,original_language,popularity,revenue,vote_average,vote_count
0,862,Toy Story,1995-10-30,en,21.946943,373554033.0,7.7,5415.0
1,8844,Jumanji,1995-12-15,en,17.015539,262797249.0,6.9,2413.0
2,15602,Grumpier Old Men,1995-12-22,en,11.712900,0.0,6.5,92.0
3,31357,Waiting to Exhale,1995-12-22,en,3.859495,81452156.0,6.1,34.0
4,11862,Father of the Bride Part II,1995-02-10,en,8.387519,76578911.0,5.7,173.0
...,...,...,...,...,...,...,...,...
45449,439050,رگ خواب,None,fa,0.072051,0.0,4.0,1.0
45450,111109,Siglo ng Pagluluwal,2011-11-17,tl,0.178241,0.0,9.0,3.0
45451,67758,Betrayal,2003-08-01,en,0.903007,0.0,3.8,6.0
45452,227506,Satana likuyushchiy,1917-10-21,en,0.003503,0.0,0.0,0.0
45453,461257,Queerama,2017-06-09,en,0.163015,0.0,0.0,0.0

#### Basic Data Exploration
First, we start with exploring the basic properties of the dataframe. In this step, we just try to understand what the data looks like and verify whether or not the data types are correct. Pandas has a lot of useful functions for this.

Identifying the shape of our data, i.e., the number of rows and columns can be done through the shape property:

In [3]:
print("Number of observations: {}".format(movies.shape[0]))
print("Number of columns:      {}".format(movies.shape[1]))

Number of observations: 45454
Number of columns:      8

Next, we check the names and data types of these columns:

In [4]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45454 entries, 0 to 45453
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 45454 non-null  object
 1   original_title     45454 non-null  object
 2   release_date       45368 non-null  object
 3   original_language  45443 non-null  object
 4   popularity         45451 non-null  float64
 5   revenue            45451 non-null  float64
 6   vote_average       45451 non-null  float64
 7   vote_count         45451 non-null  float64
dtypes: float64(4), object(4)
memory usage: 2.8+ MB

Note that the release data is **not** stored as a datetime object even though it should be a date! This can be solved using the pandas *to_datetime* function. The ID is also not stored as an integer, and the original_language is stored as a string even thought it is more of a categorical variable. All of these things can be changed using built-in pandas methods:

In [5]:
movies.release_date = pd.to_datetime(movies.release_date)
movies.id = pd.to_numeric(movies.id)
movies.original_language = pd.Categorical(movies.original_language) # Unfortunately, the inconsistent syntax is
# something you will need to accept

Next, we check some specific observations. Three methods are useful: (1) head(), (2) tail(), and (3) sample.

In [6]:
movies.head()
#movies.tail()
#movies.sample(5, random_state=123)

,id,original_title,release_date,original_language,popularity,revenue,vote_average,vote_count
0,862,Toy Story,1995-10-30,en,21.946943,373554033.0,7.7,5415.0
1,8844,Jumanji,1995-12-15,en,17.015539,262797249.0,6.9,2413.0
2,15602,Grumpier Old Men,1995-12-22,en,11.712900,0.0,6.5,92.0
3,31357,Waiting to Exhale,1995-12-22,en,3.859495,81452156.0,6.1,34.0
4,11862,Father of the Bride Part II,1995-02-10,en,8.387519,76578911.0,5.7,173.0

#### Data Subsetting and Filtering
Let's say we only want to get information on the original title of the movies and store that information in a new variable named *information*. In pandas, there are four different ways of doing this:

In [8]:
information = movies['original_title'] # Simple and allows for column names with spaces and other special characters
information = movies.original_title # Most intuitively written
information = movies.loc[:, 'original_title'] # Allows selecting specific rows and columns at same time
information = movies.iloc[:, 1] # Allows to filter based on index
information.head() # This head() method is not the same as the one used earlier!!

0                      Toy Story
1                        Jumanji
2               Grumpier Old Men
3              Waiting to Exhale
4    Father of the Bride Part II
Name: original_title, dtype: object

Filtering specific rows is done through a *mask* which is a collection of True and False values indicating which rows should be included:

In [9]:
mask = movies.original_language == 'nl'
movies.loc[mask, :] # Only filter rows -> view of DataFrame
movies[mask] # also filters rows -> creates new dataframe object
movies.loc[mask, ["original_title", "popularity", "original_language"]].head() # Rows and columns

     original_title  popularity original_language
81          Antonia    2.030174                nl
687           Daens    0.755047                nl
862              06    0.062128                nl
1752       Karakter    1.221677                nl
2710          Rosie    0.100686                nl

In [10]:
# Note: this is NOT the same as the following even though they give the same results
movies[mask][["original_title", "popularity", "original_language"]].head()

     original_title  popularity original_language
81          Antonia    2.030174                nl
687           Daens    0.755047                nl
862              06    0.062128                nl
1752       Karakter    1.221677                nl
2710          Rosie    0.100686                nl

Proof that these are not the same:

In [11]:
mask = movies.original_title == 'Toy Story'
movies.loc[mask, "original_title"] = "Toy Story I"
movies.head(2)

,id,original_title,release_date,original_language,popularity,revenue,vote_average,vote_count
0,862,Toy Story I,1995-10-30,en,21.946943,373554033.0,7.7,5415.0
1,8844,Jumanji,1995-12-15,en,17.015539,262797249.0,6.9,2413.0

In [12]:
mask = movies.original_title == 'Jumanji'
movies[mask]["original_title"] = "Jumanji I"
movies.head(2)
# Notice the warning!!

/var/folders/zz/zvsv6f4s4wn29k9lt76bdlsr0000gn/T/ipykernel_13426/2271490628.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  movies[mask]["original_title"] = "Jumanji I"

,id,original_title,release_date,original_language,popularity,revenue,vote_average,vote_count
0,862,Toy Story I,1995-10-30,en,21.946943,373554033.0,7.7,5415.0
1,8844,Jumanji,1995-12-15,en,17.015539,262797249.0,6.9,2413.0

In practice: do not chain filtering or subsetting operations